---
type: SpaceTag
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 3
tags: [revit-api, class]
---

# SpaceTag

`Autodesk.Revit.DB.Mechanical.SpaceTag` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |
| Property | Space | — | `public Space Space { get ; }` |
| Property | SpaceTagType | — | `public SpaceTagType SpaceTagType { get ; set ; }` |